Revit 2022 API
MassGBXMLExportOptions Class
 Options used when exporting a gbXML file from a mass model document.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2012
Syntax
C#
public class MassGBXMLExportOptions : IDisposable
Visual Basic
Public Class MassGBXMLExportOptions _
	Implements IDisposable
Visual C++
public ref class MassGBXMLExportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions
See Also
MassGBXMLExportOptions Members
Autodesk.Revit.DB.Analysis Namespace